data = [

767.5718326	449.0844797	425.2559037	2013.071915	449.084479	401.9099725	449.0844794	400.000007
700.1429958	449.084479	449.3420273	1727.709341	404.3496385	449.084479	449.084479	444.8954693
616.395766	471.3615028	430.7617441	3213.886309	449.0846132	449.084479	449.084479	449.084479
706.9644522	449.084479	449.4633802	1288.984865	444.8954693	469.5357238	468.5984298	400.0018351
672.2548529	449.084479	475.4912812	2321.463666	449.084479	449.084479	449.084479	449.084479
652.3772836	474.2082251	471.1369214	3319.447054	449.084479	449.084479	469.3687135	449.084479
662.4022158	454.3584084	449.5450984	2411.3272	444.8954693	449.084479	469.242442	449.084479
588.300319	522.839903	474.7912322	1714.395665	473.8544986	449.084479	405.4602131	449.084479
628.8770811	454.3584084	475.2290102	1852.300759	449.084479	449.084479	471.7677214	449.084479
682.9116523	406.6728689	449.2823476	1901.875156	428.9356063	444.8954693	449.084479	400.4518442


];


% 提取最后一列（第8列）作为参考列
reference_column = data(:, end);

% 创建一个空的表格来存储数据
resultTable = table([], [], [], 'VariableNames', {'Column', 'P_value_Symbol', 'Symbol'});

% 遍历前7列，计算p值并记录符号
for i = 1:7
    [p_value, h, stats] = ranksum(data(:, i), reference_column, 'alpha', 0.05, 'tail', 'both');

    % 确定符号
    if h == 0
        symbol = '=';
    elseif median(data(:, i)) < median(reference_column)
        symbol = '-';
    else
        symbol = '+';
    end

    % 格式化p值为四位小数，并将符号加入圆括号中
    p_value_symbol_str = sprintf('%.4f (%s)', p_value, symbol);

    % 将数据添加到表格中
    resultTable = [resultTable; {i, p_value_symbol_str, symbol}];
end

% 定义输出文件名
filename = 'D:\\研究生\\麻雀算法\\小论文\\测试集\\2020\\ok2020\\结果\\图\\W检验\\W1.xlsx';

% 使用writetable将数据写入Excel表格，不写入变量名作为标题
writetable(resultTable, filename, 'Sheet', 'Sheet10', 'WriteVariableNames', false);
